export const beadColors = [
  {
    "code": "A1",
    "hex": "#FAF5CD",
    "rgb": [
      250,
      245,
      205
    ],
    "name": "浅米黄"
  },
  {
    "code": "A2",
    "hex": "#FCFED6",
    "rgb": [
      252,
      254,
      214
    ],
    "name": "极浅黄"
  },
  {
    "code": "A3",
    "hex": "#FCFF92",
    "rgb": [
      252,
      255,
      146
    ],
    "name": "柠檬黄"
  },
  {
    "code": "A4",
    "hex": "#7FEC5C",
    "rgb": [
      247,
      236,
      92
    ],
    "name": "亮黄"
  },
  {
    "code": "A5",
    "hex": "#F0D83A",
    "rgb": [
      240,
      216,
      58
    ],
    "name": "金黄"
  },
  {
    "code": "A6",
    "hex": "#FDA951",
    "rgb": [
      253,
      169,
      81
    ],
    "name": "浅橙"
  },
  {
    "code": "A7",
    "hex": "#FA8C4F",
    "rgb": [
      250,
      140,
      79
    ],
    "name": "橙黄"
  },
  {
    "code": "A8",
    "hex": "#FBDA4D",
    "rgb": [
      251,
      218,
      77
    ],
    "name": "鲜黄"
  },
  {
    "code": "A9",
    "hex": "#F79D5F",
    "rgb": [
      247,
      157,
      95
    ],
    "name": "杏橙"
  },
  {
    "code": "A10",
    "hex": "#F47E38",
    "rgb": [
      244,
      126,
      56
    ],
    "name": "深橙"
  },
  {
    "code": "A11",
    "hex": "#FEDB99",
    "rgb": [
      254,
      219,
      153
    ],
    "name": "奶油黄"
  },
  {
    "code": "A12",
    "hex": "#FDA276",
    "rgb": [
      253,
      162,
      118
    ],
    "name": "桃橙"
  },
  {
    "code": "A13",
    "hex": "#FEC667",
    "rgb": [
      254,
      198,
      103
    ],
    "name": "浅金黄"
  },
  {
    "code": "A14",
    "hex": "#F75842",
    "rgb": [
      247,
      88,
      66
    ],
    "name": "橙红"
  },
  {
    "code": "A15",
    "hex": "#FBF65E",
    "rgb": [
      251,
      246,
      94
    ],
    "name": "嫩黄"
  },
  {
    "code": "A16",
    "hex": "#FEFF97",
    "rgb": [
      254,
      255,
      151
    ],
    "name": "鹅黄"
  },
  {
    "code": "A17",
    "hex": "#FDE173",
    "rgb": [
      253,
      225,
      115
    ],
    "name": "玉米黄"
  },
  {
    "code": "A18",
    "hex": "#FCBF80",
    "rgb": [
      252,
      191,
      128
    ],
    "name": "浅杏"
  },
  {
    "code": "A19",
    "hex": "#FD7E77",
    "rgb": [
      253,
      126,
      119
    ],
    "name": "珊瑚橙"
  },
  {
    "code": "A20",
    "hex": "#F9D666",
    "rgb": [
      249,
      214,
      102
    ],
    "name": "土黄"
  },
  {
    "code": "A21",
    "hex": "#FAE393",
    "rgb": [
      250,
      227,
      147
    ],
    "name": "米黄"
  },
  {
    "code": "A22",
    "hex": "#EDF878",
    "rgb": [
      237,
      248,
      120
    ],
    "name": "黄绿"
  },
  {
    "code": "A23",
    "hex": "#E4C8BA",
    "rgb": [
      228,
      200,
      186
    ],
    "name": "浅肤色"
  },
  {
    "code": "A24",
    "hex": "#F3F6A9",
    "rgb": [
      243,
      246,
      169
    ],
    "name": "淡黄绿"
  },
  {
    "code": "A25",
    "hex": "#FDF785",
    "rgb": [
      253,
      247,
      133
    ],
    "name": "淡黄"
  },
  {
    "code": "A26",
    "hex": "#FFC734",
    "rgb": [
      255,
      199,
      52
    ],
    "name": "深金黄"
  },
  {
    "code": "B1",
    "hex": "#DFF13B",
    "rgb": [
      223,
      241,
      59
    ],
    "name": "黄绿"
  },
  {
    "code": "B2",
    "hex": "#64F343",
    "rgb": [
      100,
      243,
      67
    ],
    "name": "亮绿"
  },
  {
    "code": "B3",
    "hex": "#A1F586",
    "rgb": [
      161,
      245,
      134
    ],
    "name": "浅绿"
  },
  {
    "code": "B4",
    "hex": "#5FDF34",
    "rgb": [
      95,
      223,
      52
    ],
    "name": "鲜绿"
  },
  {
    "code": "B5",
    "hex": "#39E158",
    "rgb": [
      57,
      225,
      88
    ],
    "name": "草绿"
  },
  {
    "code": "B6",
    "hex": "#64E0A4",
    "rgb": [
      100,
      224,
      164
    ],
    "name": "薄荷绿"
  },
  {
    "code": "B7",
    "hex": "#3EAE7C",
    "rgb": [
      62,
      174,
      124
    ],
    "name": "深薄荷"
  },
  {
    "code": "B8",
    "hex": "#1D9B54",
    "rgb": [
      29,
      155,
      84
    ],
    "name": "深绿"
  },
  {
    "code": "B9",
    "hex": "#2A5037",
    "rgb": [
      42,
      80,
      55
    ],
    "name": "墨绿"
  },
  {
    "code": "B10",
    "hex": "#9AD1BA",
    "rgb": [
      154,
      209,
      186
    ],
    "name": "浅蓝绿"
  },
  {
    "code": "B11",
    "hex": "#627032",
    "rgb": [
      98,
      112,
      50
    ],
    "name": "橄榄绿"
  },
  {
    "code": "B12",
    "hex": "#1A6E3D",
    "rgb": [
      26,
      110,
      61
    ],
    "name": "森林绿"
  },
  {
    "code": "B13",
    "hex": "#C8E87D",
    "rgb": [
      200,
      232,
      125
    ],
    "name": "淡黄绿"
  },
  {
    "code": "B14",
    "hex": "#ABE84F",
    "rgb": [
      171,
      232,
      79
    ],
    "name": "苹果绿"
  },
  {
    "code": "B15",
    "hex": "#305335",
    "rgb": [
      48,
      83,
      53
    ],
    "name": "深墨绿"
  },
  {
    "code": "B16",
    "hex": "#C0ED9C",
    "rgb": [
      192,
      237,
      156
    ],
    "name": "嫩草绿"
  },
  {
    "code": "B17",
    "hex": "#9EB33E",
    "rgb": [
      158,
      179,
      62
    ],
    "name": "橄榄黄"
  },
  {
    "code": "B18",
    "hex": "#E6ED4F",
    "rgb": [
      230,
      237,
      79
    ],
    "name": "亮黄绿"
  },
  {
    "code": "B19",
    "hex": "#26B78E",
    "rgb": [
      38,
      183,
      142
    ],
    "name": "绿松石"
  },
  {
    "code": "B20",
    "hex": "#CBECFC",
    "rgb": [
      203,
      236,
      207
    ],
    "name": "极浅绿"
  },
  {
    "code": "B21",
    "hex": "#18616A",
    "rgb": [
      24,
      97,
      106
    ],
    "name": "深青"
  },
  {
    "code": "B22",
    "hex": "#0A4241",
    "rgb": [
      10,
      66,
      65
    ],
    "name": "墨青"
  },
  {
    "code": "B23",
    "hex": "#343B1A",
    "rgb": [
      52,
      59,
      26
    ],
    "name": "深橄榄"
  },
  {
    "code": "B24",
    "hex": "#E8FAA6",
    "rgb": [
      232,
      250,
      166
    ],
    "name": "浅黄绿"
  },
  {
    "code": "B25",
    "hex": "#4E846D",
    "rgb": [
      78,
      132,
      109
    ],
    "name": "灰绿"
  },
  {
    "code": "B26",
    "hex": "#907C35",
    "rgb": [
      144,
      124,
      53
    ],
    "name": "橄榄棕"
  },
  {
    "code": "B27",
    "hex": "#D0E0AF",
    "rgb": [
      208,
      224,
      175
    ],
    "name": "灰黄绿"
  },
  {
    "code": "B28",
    "hex": "#9EE5BB",
    "rgb": [
      158,
      229,
      187
    ],
    "name": "浅薄荷"
  },
  {
    "code": "B29",
    "hex": "#C6DF5F",
    "rgb": [
      198,
      223,
      95
    ],
    "name": "黄绿"
  },
  {
    "code": "B30",
    "hex": "#E3FBB1",
    "rgb": [
      227,
      251,
      177
    ],
    "name": "极浅黄绿"
  },
  {
    "code": "B31",
    "hex": "#B4E691",
    "rgb": [
      180,
      230,
      145
    ],
    "name": "淡绿"
  },
  {
    "code": "B32",
    "hex": "#92AD60",
    "rgb": [
      146,
      173,
      96
    ],
    "name": "橄榄灰"
  },
  {
    "code": "C1",
    "hex": "#F0FEE4",
    "rgb": [
      240,
      254,
      228
    ],
    "name": "极浅蓝绿"
  },
  {
    "code": "C2",
    "hex": "#ABF8FE",
    "rgb": [
      171,
      248,
      254
    ],
    "name": "浅天蓝"
  },
  {
    "code": "C3",
    "hex": "#A2E0F7",
    "rgb": [
      162,
      224,
      247
    ],
    "name": "淡天蓝"
  },
  {
    "code": "C4",
    "hex": "#44CDFB",
    "rgb": [
      68,
      205,
      251
    ],
    "name": "天蓝"
  },
  {
    "code": "C5",
    "hex": "#06AADF",
    "rgb": [
      6,
      170,
      223
    ],
    "name": "深天蓝"
  },
  {
    "code": "C6",
    "hex": "#54A7E9",
    "rgb": [
      84,
      167,
      233
    ],
    "name": "浅蓝"
  },
  {
    "code": "C7",
    "hex": "#3977CA",
    "rgb": [
      57,
      119,
      202
    ],
    "name": "蓝色"
  },
  {
    "code": "C8",
    "hex": "#0F52BD",
    "rgb": [
      15,
      82,
      189
    ],
    "name": "深蓝"
  },
  {
    "code": "C9",
    "hex": "#3349C3",
    "rgb": [
      51,
      73,
      195
    ],
    "name": "宝蓝"
  },
  {
    "code": "C10",
    "hex": "#3CBCE3",
    "rgb": [
      60,
      188,
      227
    ],
    "name": "青蓝"
  },
  {
    "code": "C11",
    "hex": "#2ADED3",
    "rgb": [
      42,
      222,
      211
    ],
    "name": "青色"
  },
  {
    "code": "C12",
    "hex": "#1E334E",
    "rgb": [
      30,
      51,
      78
    ],
    "name": "藏青"
  },
  {
    "code": "C13",
    "hex": "#CDE7FE",
    "rgb": [
      205,
      231,
      254
    ],
    "name": "极浅蓝"
  },
  {
    "code": "C14",
    "hex": "#D5FCF7",
    "rgb": [
      213,
      252,
      247
    ],
    "name": "浅青"
  },
  {
    "code": "C15",
    "hex": "#21C5C4",
    "rgb": [
      33,
      197,
      196
    ],
    "name": "深青"
  },
  {
    "code": "C16",
    "hex": "#1858A2",
    "rgb": [
      24,
      88,
      162
    ],
    "name": "海军蓝"
  },
  {
    "code": "C17",
    "hex": "#02D1F3",
    "rgb": [
      2,
      209,
      243
    ],
    "name": "亮青"
  },
  {
    "code": "C18",
    "hex": "#213244",
    "rgb": [
      33,
      50,
      68
    ],
    "name": "深海军蓝"
  },
  {
    "code": "C19",
    "hex": "#18869D",
    "rgb": [
      24,
      134,
      157
    ],
    "name": "蓝绿"
  },
  {
    "code": "C20",
    "hex": "#1A70A9",
    "rgb": [
      26,
      112,
      169
    ],
    "name": "钢蓝"
  },
  {
    "code": "C21",
    "hex": "#BC DDFC",
    "rgb": [
      188,
      221,
      252
    ],
    "name": "淡蓝"
  },
  {
    "code": "C22",
    "hex": "#6BB1BB",
    "rgb": [
      107,
      177,
      187
    ],
    "name": "灰蓝"
  },
  {
    "code": "C23",
    "hex": "#C8E2FD",
    "rgb": [
      200,
      226,
      253
    ],
    "name": "浅蓝"
  },
  {
    "code": "C24",
    "hex": "#7EC5F9",
    "rgb": [
      126,
      197,
      249
    ],
    "name": "天蓝色"
  },
  {
    "code": "C25",
    "hex": "#A9E8E0",
    "rgb": [
      169,
      232,
      224
    ],
    "name": "浅青蓝"
  },
  {
    "code": "C26",
    "hex": "#42ADCF",
    "rgb": [
      66,
      173,
      207
    ],
    "name": "中蓝"
  },
  {
    "code": "C27",
    "hex": "#D0DEF9",
    "rgb": [
      208,
      222,
      249
    ],
    "name": "极浅蓝"
  },
  {
    "code": "C28",
    "hex": "#BDCEE8",
    "rgb": [
      189,
      206,
      232
    ],
    "name": "灰蓝"
  },
  {
    "code": "C29",
    "hex": "#364A89",
    "rgb": [
      54,
      74,
      137
    ],
    "name": "靛蓝"
  },
  {
    "code": "E1",
    "hex": "#F6D4CB",
    "rgb": [
      246,
      212,
      203
    ],
    "name": "浅粉"
  },
  {
    "code": "E2",
    "hex": "#FCC1DD",
    "rgb": [
      252,
      193,
      221
    ],
    "name": "淡粉"
  },
  {
    "code": "E3",
    "hex": "#F6BDE8",
    "rgb": [
      246,
      189,
      232
    ],
    "name": "浅玫粉"
  },
  {
    "code": "E4",
    "hex": "#E8649E",
    "rgb": [
      232,
      100,
      158
    ],
    "name": "玫粉"
  },
  {
    "code": "E5",
    "hex": "#F0569F",
    "rgb": [
      240,
      86,
      159
    ],
    "name": "深玫粉"
  },
  {
    "code": "E6",
    "hex": "#EB4172",
    "rgb": [
      235,
      65,
      114
    ],
    "name": "玫红"
  },
  {
    "code": "E7",
    "hex": "#C53674",
    "rgb": [
      197,
      54,
      116
    ],
    "name": "深玫红"
  },
  {
    "code": "E8",
    "hex": "#FDBE9",
    "rgb": [
      253,
      219,
      233
    ],
    "name": "极浅粉"
  },
  {
    "code": "E9",
    "hex": "#E376C7",
    "rgb": [
      227,
      118,
      199
    ],
    "name": "紫粉"
  },
  {
    "code": "E10",
    "hex": "#D13B95",
    "rgb": [
      209,
      59,
      149
    ],
    "name": "深紫粉"
  },
  {
    "code": "E11",
    "hex": "#F7DAD4",
    "rgb": [
      247,
      218,
      212
    ],
    "name": "浅肤色"
  },
  {
    "code": "E12",
    "hex": "#F693BF",
    "rgb": [
      246,
      147,
      191
    ],
    "name": "中粉"
  },
  {
    "code": "E13",
    "hex": "#B5026A",
    "rgb": [
      181,
      2,
      106
    ],
    "name": "深玫红"
  },
  {
    "code": "E14",
    "hex": "#FAD4BF",
    "rgb": [
      250,
      212,
      191
    ],
    "name": "浅肤色"
  },
  {
    "code": "E15",
    "hex": "#F5C9CA",
    "rgb": [
      245,
      201,
      202
    ],
    "name": "淡粉"
  },
  {
    "code": "E16",
    "hex": "#FBF4EC",
    "rgb": [
      251,
      244,
      236
    ],
    "name": "极浅肤色"
  },
  {
    "code": "E17",
    "hex": "#F7E3EC",
    "rgb": [
      247,
      227,
      236
    ],
    "name": "极浅粉"
  },
  {
    "code": "E18",
    "hex": "#F9C8DB",
    "rgb": [
      249,
      200,
      219
    ],
    "name": "浅粉"
  },
  {
    "code": "E19",
    "hex": "#F6BBD1",
    "rgb": [
      246,
      187,
      209
    ],
    "name": "中粉"
  },
  {
    "code": "E20",
    "hex": "#D7C6CE",
    "rgb": [
      215,
      198,
      206
    ],
    "name": "灰粉"
  },
  {
    "code": "E21",
    "hex": "#C09DA4",
    "rgb": [
      192,
      157,
      164
    ],
    "name": "深灰粉"
  },
  {
    "code": "E22",
    "hex": "#B38C9F",
    "rgb": [
      179,
      140,
      159
    ],
    "name": "暗灰粉"
  },
  {
    "code": "E23",
    "hex": "#937D8A",
    "rgb": [
      147,
      125,
      138
    ],
    "name": "深灰粉"
  },
  {
    "code": "E24",
    "hex": "#DEBEE5",
    "rgb": [
      222,
      190,
      229
    ],
    "name": "淡紫粉"
  },
  {
    "code": "F1",
    "hex": "#FE9381",
    "rgb": [
      254,
      147,
      129
    ],
    "name": "浅红"
  },
  {
    "code": "F2",
    "hex": "#F63D4B",
    "rgb": [
      246,
      61,
      75
    ],
    "name": "红色"
  },
  {
    "code": "F3",
    "hex": "#EE4E3E",
    "rgb": [
      238,
      78,
      62
    ],
    "name": "橙红"
  },
  {
    "code": "F4",
    "hex": "#FB2A40",
    "rgb": [
      251,
      42,
      64
    ],
    "name": "亮红"
  },
  {
    "code": "F5",
    "hex": "#E10328",
    "rgb": [
      225,
      3,
      40
    ],
    "name": "深红"
  },
  {
    "code": "F6",
    "hex": "#913635",
    "rgb": [
      145,
      54,
      53
    ],
    "name": "暗红"
  },
  {
    "code": "F7",
    "hex": "#911932",
    "rgb": [
      145,
      25,
      50
    ],
    "name": "酒红"
  },
  {
    "code": "F8",
    "hex": "#BB0126",
    "rgb": [
      187,
      1,
      38
    ],
    "name": "大红"
  },
  {
    "code": "F9",
    "hex": "#E0677A",
    "rgb": [
      224,
      103,
      122
    ],
    "name": "浅红"
  },
  {
    "code": "F10",
    "hex": "#874628",
    "rgb": [
      135,
      70,
      40
    ],
    "name": "红棕"
  },
  {
    "code": "F11",
    "hex": "#592323",
    "rgb": [
      89,
      35,
      35
    ],
    "name": "深棕红"
  },
  {
    "code": "F12",
    "hex": "#F3536B",
    "rgb": [
      243,
      83,
      107
    ],
    "name": "粉红"
  },
  {
    "code": "F13",
    "hex": "#F45C45",
    "rgb": [
      244,
      92,
      69
    ],
    "name": "橙红"
  },
  {
    "code": "F14",
    "hex": "#FCADB2",
    "rgb": [
      252,
      173,
      178
    ],
    "name": "浅粉红"
  },
  {
    "code": "F15",
    "hex": "#D50527",
    "rgb": [
      213,
      5,
      39
    ],
    "name": "正红"
  },
  {
    "code": "F16",
    "hex": "#F8C0A9",
    "rgb": [
      248,
      192,
      169
    ],
    "name": "浅肤色"
  },
  {
    "code": "F17",
    "hex": "#E89B7D",
    "rgb": [
      232,
      155,
      125
    ],
    "name": "浅棕红"
  },
  {
    "code": "F18",
    "hex": "#D07F4A",
    "rgb": [
      208,
      127,
      74
    ],
    "name": "棕红"
  },
  {
    "code": "F19",
    "hex": "#BE454A",
    "rgb": [
      190,
      69,
      74
    ],
    "name": "暗红"
  },
  {
    "code": "F20",
    "hex": "#C69495",
    "rgb": [
      198,
      148,
      149
    ],
    "name": "灰红"
  },
  {
    "code": "F21",
    "hex": "#F2B8C6",
    "rgb": [
      242,
      184,
      198
    ],
    "name": "淡粉红"
  },
  {
    "code": "F22",
    "hex": "#F7C3D0",
    "rgb": [
      247,
      195,
      208
    ],
    "name": "浅粉红"
  },
  {
    "code": "F23",
    "hex": "#ED806C",
    "rgb": [
      237,
      128,
      108
    ],
    "name": "珊瑚红"
  },
  {
    "code": "F24",
    "hex": "#E09DAF",
    "rgb": [
      224,
      157,
      175
    ],
    "name": "灰粉红"
  },
  {
    "code": "F25",
    "hex": "#E84854",
    "rgb": [
      232,
      72,
      84
    ],
    "name": "亮红"
  },
  {
    "code": "G1",
    "hex": "#FFE4D3",
    "rgb": [
      255,
      228,
      211
    ],
    "name": "浅肤色"
  },
  {
    "code": "G2",
    "hex": "#FCC6AC",
    "rgb": [
      252,
      198,
      172
    ],
    "name": "浅棕"
  },
  {
    "code": "G3",
    "hex": "#F1C4A5",
    "rgb": [
      241,
      196,
      165
    ],
    "name": "淡棕"
  },
  {
    "code": "G4",
    "hex": "#DCB387",
    "rgb": [
      220,
      179,
      135
    ],
    "name": "土黄棕"
  },
  {
    "code": "G5",
    "hex": "#E7B34E",
    "rgb": [
      231,
      179,
      78
    ],
    "name": "金棕"
  },
  {
    "code": "G6",
    "hex": "#E3A014",
    "rgb": [
      227,
      160,
      20
    ],
    "name": "深金棕"
  },
  {
    "code": "G7",
    "hex": "#985C3A",
    "rgb": [
      152,
      92,
      58
    ],
    "name": "棕色"
  },
  {
    "code": "G8",
    "hex": "#713D2F",
    "rgb": [
      113,
      61,
      47
    ],
    "name": "深棕"
  },
  {
    "code": "G9",
    "hex": "#E4B685",
    "rgb": [
      228,
      182,
      133
    ],
    "name": "浅棕"
  },
  {
    "code": "G10",
    "hex": "#DA8C42",
    "rgb": [
      218,
      140,
      66
    ],
    "name": "橙棕"
  },
  {
    "code": "G11",
    "hex": "#DAC898",
    "rgb": [
      218,
      200,
      152
    ],
    "name": "浅黄棕"
  },
  {
    "code": "G12",
    "hex": "#FEC993",
    "rgb": [
      254,
      201,
      147
    ],
    "name": "浅棕"
  },
  {
    "code": "G13",
    "hex": "#B2714B",
    "rgb": [
      178,
      113,
      75
    ],
    "name": "中棕"
  },
  {
    "code": "G14",
    "hex": "#8B684C",
    "rgb": [
      139,
      104,
      76
    ],
    "name": "深棕"
  },
  {
    "code": "G15",
    "hex": "#F6F8E3",
    "rgb": [
      246,
      248,
      227
    ],
    "name": "极浅黄棕"
  },
  {
    "code": "G16",
    "hex": "#F2D8C1",
    "rgb": [
      242,
      216,
      193
    ],
    "name": "浅棕"
  },
  {
    "code": "G17",
    "hex": "#77544E",
    "rgb": [
      119,
      84,
      78
    ],
    "name": "深棕"
  },
  {
    "code": "G18",
    "hex": "#FFE3D5",
    "rgb": [
      255,
      227,
      213
    ],
    "name": "浅肤色"
  },
  {
    "code": "G19",
    "hex": "#DD7D41",
    "rgb": [
      221,
      125,
      65
    ],
    "name": "橙棕"
  },
  {
    "code": "G20",
    "hex": "#A5452F",
    "rgb": [
      165,
      69,
      47
    ],
    "name": "红棕"
  },
  {
    "code": "G21",
    "hex": "#B38561",
    "rgb": [
      179,
      133,
      97
    ],
    "name": "灰棕"
  },
  {
    "code": "H1",
    "hex": "#FFFFFF",
    "rgb": [
      255,
      255,
      255
    ],
    "name": "纯白"
  },
  {
    "code": "H2",
    "hex": "#FBFBFB",
    "rgb": [
      251,
      251,
      251
    ],
    "name": "极浅灰"
  },
  {
    "code": "H3",
    "hex": "#B4B4B4",
    "rgb": [
      180,
      180,
      180
    ],
    "name": "中灰"
  },
  {
    "code": "H4",
    "hex": "#878787",
    "rgb": [
      135,
      135,
      135
    ],
    "name": "深灰"
  },
  {
    "code": "H5",
    "hex": "#464648",
    "rgb": [
      70,
      70,
      72
    ],
    "name": "近黑灰"
  },
  {
    "code": "H6",
    "hex": "#2C2C2C",
    "rgb": [
      44,
      44,
      44
    ],
    "name": "深灰黑"
  },
  {
    "code": "H7",
    "hex": "#010101",
    "rgb": [
      1,
      1,
      1
    ],
    "name": "纯黑"
  },
  {
    "code": "H8",
    "hex": "#E7D6DC",
    "rgb": [
      231,
      214,
      220
    ],
    "name": "浅粉灰"
  },
  {
    "code": "H9",
    "hex": "#EFEDEE",
    "rgb": [
      239,
      237,
      238
    ],
    "name": "极浅灰"
  },
  {
    "code": "H10",
    "hex": "#EBEBEB",
    "rgb": [
      235,
      235,
      235
    ],
    "name": "浅灰"
  },
  {
    "code": "H11",
    "hex": "#CDCDCD",
    "rgb": [
      205,
      205,
      205
    ],
    "name": "中灰"
  },
  {
    "code": "H12",
    "hex": "#FDF6EE",
    "rgb": [
      253,
      246,
      238
    ],
    "name": "浅米灰"
  },
  {
    "code": "H13",
    "hex": "#F4EDF1",
    "rgb": [
      244,
      237,
      241
    ],
    "name": "浅紫灰"
  },
  {
    "code": "H14",
    "hex": "#CED7D4",
    "rgb": [
      206,
      215,
      212
    ],
    "name": "浅蓝灰"
  },
  {
    "code": "H15",
    "hex": "#9AA6A6",
    "rgb": [
      154,
      166,
      166
    ],
    "name": "中蓝灰"
  },
  {
    "code": "H16",
    "hex": "#1B1213",
    "rgb": [
      27,
      18,
      19
    ],
    "name": "深黑"
  },
  {
    "code": "H17",
    "hex": "#F0EEEF",
    "rgb": [
      240,
      238,
      239
    ],
    "name": "极浅灰"
  },
  {
    "code": "H18",
    "hex": "#FCFFF6",
    "rgb": [
      252,
      255,
      246
    ],
    "name": "极浅黄绿灰"
  },
  {
    "code": "H19",
    "hex": "#F2EEE5",
    "rgb": [
      242,
      238,
      229
    ],
    "name": "浅米灰"
  },
  {
    "code": "H20",
    "hex": "#96A09F",
    "rgb": [
      150,
      160,
      159
    ],
    "name": "中绿灰"
  },
  {
    "code": "H21",
    "hex": "#F8FBE6",
    "rgb": [
      248,
      251,
      230
    ],
    "name": "极浅黄绿灰"
  },
  {
    "code": "H22",
    "hex": "#CACAD2",
    "rgb": [
      202,
      202,
      210
    ],
    "name": "中灰"
  },
  {
    "code": "H23",
    "hex": "#9B9C94",
    "rgb": [
      155,
      156,
      148
    ],
    "name": "深绿灰"
  },
  {
    "code": "M1",
    "hex": "#BBC6B6",
    "rgb": [
      187,
      198,
      182
    ],
    "name": "浅绿灰"
  },
  {
    "code": "M2",
    "hex": "#909994",
    "rgb": [
      144,
      153,
      148
    ],
    "name": "中绿灰"
  },
  {
    "code": "M3",
    "hex": "#697E81",
    "rgb": [
      105,
      126,
      129
    ],
    "name": "深绿灰"
  },
  {
    "code": "M4",
    "hex": "#E0D4BC",
    "rgb": [
      224,
      212,
      188
    ],
    "name": "浅米棕"
  },
  {
    "code": "M5",
    "hex": "#D1CCAF",
    "rgb": [
      209,
      204,
      175
    ],
    "name": "浅黄棕"
  },
  {
    "code": "M6",
    "hex": "#B0AA86",
    "rgb": [
      176,
      170,
      134
    ],
    "name": "中黄棕"
  },
  {
    "code": "M7",
    "hex": "#B0A796",
    "rgb": [
      176,
      167,
      150
    ],
    "name": "灰棕"
  },
  {
    "code": "M8",
    "hex": "#AE8082",
    "rgb": [
      174,
      128,
      130
    ],
    "name": "红棕灰"
  },
  {
    "code": "M9",
    "hex": "#A68862",
    "rgb": [
      166,
      136,
      98
    ],
    "name": "棕灰"
  },
  {
    "code": "M10",
    "hex": "#C4B3BB",
    "rgb": [
      196,
      179,
      187
    ],
    "name": "粉棕灰"
  },
  {
    "code": "M11",
    "hex": "#9D7693",
    "rgb": [
      157,
      118,
      147
    ],
    "name": "紫棕灰"
  },
  {
    "code": "M12",
    "hex": "#644B51",
    "rgb": [
      100,
      75,
      81
    ],
    "name": "深紫棕灰"
  },
  {
    "code": "M13",
    "hex": "#C79266",
    "rgb": [
      199,
      146,
      102
    ],
    "name": "浅棕"
  },
  {
    "code": "M14",
    "hex": "#C27563",
    "rgb": [
      194,
      117,
      99
    ],
    "name": "红棕"
  },
  {
    "code": "M15",
    "hex": "#747D7A",
    "rgb": [
      116,
      125,
      122
    ],
    "name": "深绿灰"
  }
]
